{
    "AES": "미국 정부 표준으로 지정된 블록 암호 형식으로 이전의 DES를 대체하며, 미국 표준 기술 연구소 (NIST)가 5년의 표준화 과정을 거쳐 2001년 11월 26일에 연방 정보처리표준(FIPS 197)으로 발표하였다.",
    "CAPTCHA": "HIP(Human Interaction Proof) 기술의 일종으로, 어떠한 사용자가 실제 사람인지 컴퓨터 프로그램인지를 구별하기 위해 사용되는 방법이다.",
    "DES 알고리즘": "OO암호는 암호화 키와 복호화키가 같은 대칭키 암호로 64비트의 암호화키를 사용한다. 전수공격(Brute Force)공격에 취약하다.",
    "FIPS": "OO는 미연방 정부 기관 및 정부 계약자를 위한 미국 연방 정부에서 개발하여 공개한 컴퓨터시스템 사용 표준이다.",
    "FIPS 140-2": "OO는 암호화 모듈을 승인하는데 사용되는 미국 정부 컴퓨터 보안 표준으로 제목은 '암호화 모듈에 대한 보안 요구 사항'이다.",
    "HMAC": "OO는 메시지 다이제스트 알고리즘 5(MD-5), SHA-1 등 반복적인 암호화 해시 기능을 비밀 공용키와 함께 사용하며, 체크섬을 변경하는 것이 불가능하도록 한 키 기반의 메시지 인증 알고리즘이다.",
    "HTTPS": "WWW(월드 와이드 웹) 통신 프로토콜인 HTTP의 보안이 강화된 버전이다.",
    "LDAP": "TCP/IP 위에서 디렉토리 서비스를 조회하고 수정하는 응용 프로토콜이다.",
    "NIST": "OO는 국립 표준국이라고 알려진 측정 표준 실험실로 미국 상무부 산하의 비규제 기관이다.",
    "PreparedStatement": "컴파일된 쿼리 객체로 MySQL, Oracle, DB2, SQL Server 등에서 지원하며, Java의 JDBC, Perl의 DBI, PHP의 PDO, ASP의 ADO를 이용하여 사용 가능하다.",
    "RC5": "1994년 RSA Security사의 Ronald Rivest에 의해 고안된 블록 암호화 알고리즘이다.",
    "SHA": "해시알고리즘의 일종으로 MD5의 취약성을 대신하여 사용한다. SHA, SHA‐1, SHA‐2(SHA‐224, SHA‐256, SHA‐384, SHA‐512) 등의 다양한 버전이 있으며, 암호 프로토콜인 TLS, SSL,PGP, SSH, IPSec 등에 사용된다.",
    "Spring 프레임워크": "개발 효율성과 생산성을 최대로 높일 수 있도록 지원하기 위해 개발된 J2EE기반의 오픈소스 개발 프레임워크이다.",
    "Synchronized": "JAVA에서 임계코드를 동기화하기 위해서 제공하는 구문이다.",
    "Umask": "파일 또는 디렉토리의 권한을 설정하기 위한 명령어이다.",
    "개인키": "공개키 기반구조에서 OO란 암·복호화를 위해 비밀 메시지를 교환하는 당사자만이 알고 있는 키이다.",
    "경로순회": "상대경로 참조 방식(“./”,“../”등)을 이용해 다른 디렉토리의 중요파일에 접근하는 공격방법으로 경로 추적이라고도 한다.",
    "공개키": "OO는 지정된 인증기관에 의해 제공되는 키값으로서, 이 공개키로부터 생성된 개인키와 함께 결합되어, 메시지 및 전자서명의 암·복호화에 효과적으로 사용될 수 있다. 공개키를 사용하는 시스템을 OO 기반구조라 한다.",
    "동적 SQL": "프로그램의 조건에 따라 SQL문이 다르게 생성되는 경우, 프로그램 실행시에 전체 쿼리문이 완성되어 DB에 요청하는 SQL문을 말한다.",
    "동적쿼리": "컬럼이나 테이블명을 바꿔 SQL쿼리를 실시간 생성해 DB에 전달하여 처리하는 방식",
    "샌드박스": "어린이가 다치는 것을 방지하기 위해 만든 모래 통에서 유래되었다. JAVA가 지원하는 기본 보안 SW로써, 외부에서 받은 프로그램을 JVM(Java Virtual Machine)이라는 보호된 영역안에 가둔 뒤 작동시키는 방법으로 프로그램이 폭주하거나 악성 바이러스가 침투하는 경우를 대비한다.",
    "서블릿": "자바 OO은 자바를 사용하여 웹페이지를 동적으로 생성하는 서버 측 프로그램 혹은 그 사양을 말한다.",
    "소프트웨어 개발보안": "소프트웨어 개발과정에서 개발자 실수, 논리적 오류 등으로 인해 소프트웨어에 내재된 보안취약점을 최소화하는 한편, 해킹 등 보안위협에 대응할 수 있는 안전한 소프트웨어를 개발하기 위한 일련의 과정을 의미한다. 넓은 의미에서 소프트웨어 개발보안은 소프트웨어 생명주기의 각 단계 별로 요구되는 보안활동을 모두 포함하며, 좁은 의미로는 SW개발과정에서 소스코드를 작성하는 구현 단계에서 보안취약점을 배제하기 위한 ‘시큐어코딩(Secure Coding)’을 의미한다.",
    "소프트웨어 보안약점": "소프트웨어 결함, 오류 등으로 해킹 등 사이버공격을 유발할 가능성이 있는 잠재적인 보안취약점을 말한다.",
    "소프트웨어 보안약점 진단도구": "개발과정에서 소스코드상의 소프트웨어 보안약점을 찾기 위하여 사용하는 도구를 말한다.",
    "소프트웨어 보안약점 진단원": "소프트웨어 보안약점이 남아있는지 진단하여 조치방안을 수립하고 조치결과 확인 등의 활동을 수행하는 자를 말한다.",
    "스트러츠": "웹 개발을 단순화하는데 효과적인 오픈소스 프레임워크로 아파치 그룹에서 개발하여 제공하고 있다.",
    "싱글톤 패턴": "하나의 프로그램 내에서 하나의 인스턴스만을 생성해야만 하는 패턴이다. Connection Pool, Thread Pool과 같이 Pool 형태로 관리되는 클래스의 경우 프로그램 내에서 단하나의 인스턴트로 관리해야 하는 경우를 말함. java에서는 객체로 제공된다.",
    "임계구역": "병렬컴퓨팅에서 둘 이상의 스레드가 동시에 접근해서는 안되는 공유자원(자료 구조 또는 장치)을 접근하는 코드부분을 말한다.",
    "정적 SQL": "동적 SQL과 달리 프로그램 소스코드에 이미 쿼리문이 완성된 형태로 고정되어 있다.",
    "해시함수": "주어진 원문에서 고정된 길이의 의사난수를 생성하는 연산기법이며, 생성된 값은 ‘해시값’이라고 한다. MD5, SHA, SHA‐1, SHA‐256 등의 알고리즘이 있다.",
    "화이트리스트": "블랙리스트(Black List)의 반대개념으로 신뢰할 수 있는 사이트나 IP주소 목록을 말한다.",
    "Level 1" : "FIPS 140-2 레벨 분류 중 어떠한 레벨에 해당하는가?\n암호모듈에 대한 기본적인 보안요구사항만을 충족하여 최소한의 보안을 제공한다.",
    "Level 2" : "FIPS 140-2 레벨 분류 중 어떠한 레벨에 해당하는가?\n침입자의 불법적인 접근을 방지하고, 침입 이후에 변조를 나타내는 증거를 제공함으로써, 보안 메커니즘을 제공한다.",
    "Level 3" : "FIPS 140-2 레벨 분류 중 어떠한 레벨에 해당하는가?\n강력한 변조 탐지 및 대응의 일환으로 침입을 감지하면 저장된 키를 삭제한다/",
    "Level 4" : "FIPS 140-2 레벨 분류 중 어떠한 레벨에 해당하는가?\n암호 모듈 외부의 전압이나 온도 등을 감지하여 슈퍼쿨링 등 환경의 이상 변화 시, 암호키를 삭제한다.",
    "setExecutable": "File Class에서 대상 파일의 실행 권한을 설정하는 함수는 무엇인가?",
    "setReadable": "File Class에서 대상 파일의 읽기 권한을 설정하는 함수는 무엇인가?",
    "setWriteable": "File Class에서 대상 파일의 쓰기 권한을 설정하는 함수는 무엇인가?",
    "setMaxAge": "쿠키의 만료 시간을 지정하는 함수는 무엇인가?",
    "setSecure": "쿠키가 HTTPS 통신에서만 전달되도록 설정하는 함수는 무엇인가?",
    "setHttpOnly": "브라우저에서 자바 스크립트를 통해 쿠키에 접근할 수 없도록 설정하는 함수는 무엇인가?",
    "addCookie": "쿠키에 특정 값을 추가 할 때, 사용하는 함수는 무엇인가?",
    "인터셉트 컴포넌트": "MVC 프레임워크에서 요청과 응답을 가로채고 전처리, 후처리를 통해 입력 값을 검증할 때 사용되는 필터는 무엇인가?",
    "웹 컴포넌트 필터": "웹 애플리케이션에서 요청과 응답을 가로채고 전처리, 후처리를 통해 입력 값을 검증할 때 사용되는 필터는 무엇인가?",
    "validator 컴포넌트": "웹 애플리케이션에서 사용자 입력 데이터를 검증하는데 사용되는 구성 요소이다.\n이를 통해 입력된 데이터가 특정 기준이나 규칙을 충족하는지 확인하여 유효성을 검사한다.\n문제에서 설명하는 필터는 무엇인가?",
    "finally": "Java 언어에서 자원을 할당 받아 사용한 후, 프로그램 에러 또는 예외 발생으로 자원을 반납하지 못하는 경우가 있다. 이때, OO 블록을 사용하면 예외가 발생하더라도 자원 해제가 가능하다.",
    "replaceAll": "Java에서 특정 문자를 다른 문자로 치환할 때 사용되는 함수는 무엇인가?",
    "sendRedirect": "Java에서 외부 입력 값을 이용하여 URL을 이동시키는 함수는 무엇인가?",
    "SBOM": "조업에서 널리 사용되고 있는 자재명세서 또는 부품표의 개념을 SW 분야에 적용한 것은 무엇인가?",
    "HBOM": "특정 하드웨어 제품에 포함된 모든 구성 요소에 대한 상세 정보를 의미하는 것은 무엇인가?",
    "공급망 공격": "오픈소스 개발 환경 대상으로 APT 기반의 OO 공격 확대가 우려되고 있다. 빈 칸에 들어 갈 용어는 무엇인가?",
    "행정안전부": "전자정부법에 개발보안 법적 근거를 마련하고, SW 보안약점 진단원 제도를 명시하여 국가 전문 자격으로 개선 계획하는 기관은 어디인가?",
    "국가보안기술 연구소장": "감리법인이 소프트웨어 보안약점 진단도구 사용 시, OO이 인증한 보안약점 진단도구를 사용해야 한다. 빈 칸에 들어 갈 용어는 무엇인가?",
    "O": "감리법인은 소프트웨어 보안약점 진단 시, 진단원을 우선적으로 배치 해야한다 (O/X)",
    "개인정보의 안전성 확보조치 기준": "개인정보처리자가 개인정보를 처리함에 있어서 개인정보가 분실, 도난, 유출, 변조, 훼손되지 아니하도록 안전성을 확보하기 위해 취해야 하는 세부적인 기준은 무엇인가?",
    "행정기관 및 공공기관 정보시스템 구축 운영 지침": "행정기관등의 장이 정보시스템을 구축ㆍ운영함에 있어서 준수해야 할 기준, 표준 및 절차에 대한 사항이 기재되어 있는 문서는 무엇인가?",
    "제로 트러스트": "모바일, 사물인터넷, 클라우드의 확산으로 원격재택 근무환경이 조성되었고, 코로나 19로 비대면사회가 가속되어 기업망 보호를 위한 전통적인 사이버보안 체계의 변화가 필요함을 느끼며, 정보 시스템 및 서비스에 대한 접속요구가 있을 때 네트워크가 이미 침해된 것으로 간주하고, 주어진 권한을 정확하고 최소한으로 부여하는데 있어서 불확실성을 최소화하도록 설계된 개념 및 아이디어 모음을 무엇이라고 하는가?",
    "제로 트러스트 아키텍처": "제로트러스트 개념을 사용한 기업 사이버보안 계획으로 컴포넌트간 관계, 크플로우 설계, 접근 정책이 포함된 것을 무엇이라고 하는가?",
    "KCDSA": "국내 국가표준 전자서명 알고리즘으로 1997년 국가표준으로 채택되었으며, 이후 지속적인 수정 및 보완작업을 거쳐 1998년 10월 TTA 단체표준으로 제정되었다. ElGamal 전자서명을 개선한 방식으로 이산대수 문제의 어려움에 근거한 방식이며, DSS를 변형한 방안을 사용한다. 해당 암호화 알고리즘은 무엇인가?",
    "invalidate()": "Java에서 로그아웃 시 사용된 세션은 제거해야 한다. 이때, session.OO 함수가 사용된다. 빈칸에 들어 갈 함수명은 무엇인가?"
  }